tests/UKHO.ERPFacade.API.UnitTests/ERPTestData/ActionItemNodeTest.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Z_ADDS_MAT_INFO xmlns="urn:sap-com:document:sap:rfc:functions">
      <IM_MATINFO xmlns="">
        <CORRID></CORRID>
        <NOOFACTIONS></NOOFACTIONS>
        <RECDATE></RECDATE>
        <RECTIME></RECTIME>
        <ORG>UKHO</ORG>
<ACTIONITEMS>
<item>
  <ACTIONNUMBER>4</ACTIONNUMBER>
  <ACTION>REPLACED WITH ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY>US4AK6NT</REPLACEDBY>
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>4</ACTIONNUMBER>
  <ACTION>REPLACED WITH ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY>US4AK6NU</REPLACEDBY>
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>9</ACTIONNUMBER>
  <ACTION>CANCEL ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>10</ACTIONNUMBER>
  <ACTION>CANCEL AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL />
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>1</ACTIONNUMBER>
  <ACTION>CREATE ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>US4AK6NT</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>medium</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO>8</EDITIONNO>
  <UPDATENO>2</UPDATENO>
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>1</ACTIONNUMBER>
  <ACTION>CREATE ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>US4AK6NU</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>medium</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO>8</EDITIONNO>
  <UPDATENO>2</UPDATENO>
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>2</ACTIONNUMBER>
  <ACTION>CREATE AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL />
  <PRODUCTNAME>US4AK6NT</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>large</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE>AVCS Units Coastal</UNITTYPE>
</item>
<item>
  <ACTIONNUMBER>2</ACTIONNUMBER>
  <ACTION>CREATE AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL />
  <PRODUCTNAME>US4AK6NU</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>large</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE>AVCS Units Coastal</UNITTYPE>
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>US4AK6NT</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>US4AK6NU</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>AVCSO</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>AVCSO</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>PAYSF</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>PAYSF</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>8</ACTIONNUMBER>
  <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>8</ACTIONNUMBER>
  <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>AVCSO</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>8</ACTIONNUMBER>
  <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>PAYSF</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>4</ACTIONNUMBER>
  <ACTION>REPLACED WITH ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY>US4AK6NT</REPLACEDBY>
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>4</ACTIONNUMBER>
  <ACTION>REPLACED WITH ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY>US4AK6NU</REPLACEDBY>
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>9</ACTIONNUMBER>
  <ACTION>CANCEL ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>10</ACTIONNUMBER>
  <ACTION>CANCEL AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL />
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>1</ACTIONNUMBER>
  <ACTION>CREATE ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>US4AK6NT</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>medium</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO>8</EDITIONNO>
  <UPDATENO>2</UPDATENO>
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>1</ACTIONNUMBER>
  <ACTION>CREATE ENC CELL</ACTION>
  <PRODUCT>ENC CELL</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>US4AK6NU</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>medium</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO>8</EDITIONNO>
  <UPDATENO>2</UPDATENO>
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>2</ACTIONNUMBER>
  <ACTION>CREATE AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL />
  <PRODUCTNAME>US4AK6NT</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>large</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE>AVCS Units Coastal</UNITTYPE>
</item>
<item>
  <ACTIONNUMBER>2</ACTIONNUMBER>
  <ACTION>CREATE AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL />
  <PRODUCTNAME>US4AK6NU</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY>US</AGENCY>
  <PROVIDER>1</PROVIDER>
  <ENCSIZE>large</ENCSIZE>
  <TITLE>Norton Sound - Alaska</TITLE>
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE>AVCS Units Coastal</UNITTYPE>
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>US4AK6NT</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>US4AK6NU</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>AVCSO</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>AVCSO</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NT</CHILDCELL>
  <PRODUCTNAME>PAYSF</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>3</ACTIONNUMBER>
  <ACTION>ASSIGN CELL TO AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US4AK6NU</CHILDCELL>
  <PRODUCTNAME>PAYSF</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>8</ACTIONNUMBER>
  <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>US5AK83M</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>8</ACTIONNUMBER>
  <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>AVCSO</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
<item>
  <ACTIONNUMBER>8</ACTIONNUMBER>
  <ACTION>REMOVE ENC CELL FROM AVCS UNIT OF SALE</ACTION>
  <PRODUCT>AVCS UNIT</PRODUCT>
  <PRODTYPE>S57</PRODTYPE>
  <CHILDCELL>US5AK83M</CHILDCELL>
  <PRODUCTNAME>PAYSF</PRODUCTNAME>
  <CANCELLED />
  <REPLACEDBY />
  <AGENCY />
  <PROVIDER />
  <ENCSIZE />
  <TITLE />
  <EDITIONNO />
  <UPDATENO />
  <UNITTYPE />
</item>
  </ACTIONITEMS>
      </IM_MATINFO>
    </Z_ADDS_MAT_INFO>
  </soap:Body>
</soap:Envelope>
